bench/disk/container/disk_8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: directio
128 files, 960MiB each
120GiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      346798.81
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  1354.68
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0002s
    total number of events:              3469756

Latency (ms):
         min:                                    0.01
         avg:                                    0.02
         max:                                    0.47
         95th percentile:                        0.03
         sum:                                78543.61

Threads fairness:
    events (avg/stddev):           433719.5000/23910.01
    execution time (avg/stddev):   9.8180/0.04